Repository: bartzaalberg/snaptastic
Catalog: po/extra/*.po
Languages: fr, it

source: A manager for snaps
fr: Un gestionnaire pour les snaps
it: Un gestore pacchetti snap

source: Install your snaps, both downloaded and from online stores like snapcraft.io (right from the browser!). Update with one click in the app, and more! Do everything you need to do without the necessity of opening the terminal.
fr: Installez vos snaps, téléchargés ou provenant de boutiques en ligne comme snapcraft.io (directement depuis le navigateur !). Mise à jour en un seul clic dans l'application, et plus encore ! Faites tout ce que vous avez à faire sans avoir à ouvrir le terminal.
it: Installa i tuoi pacchetti snap, sia scaricati che da negozi online come snapcraft.io (direttamente dal browser!). Aggiorna con un click nell'app e molto altro ancora! Fate tutto quello che dovete fare senza la necessità di aprire il terminale.

source: Features:
fr: Fonctionnalités :
it: Funzionalità:

source: Install snap files
fr: Installez des fichiers snap
it: Installa pacchetti snap

source: Update, remove, and view information about your installed snaps
fr: Mettez à jour, désinstallez et visualisez des informations sur vos snaps installés
it: Aggiorna, elimina e visualizza le informazioni sui pacchetti snap installati

source: Search through your installed snaps
fr: Recherchez parmi vos snaps installés
it: Cerca tra gli snaps installati

source: Install snaps from web a uri
fr: Installez des snaps depuis une adresse web
it: Installare gli snaps da web uri

source: Choose between light and dark with dark mode
fr: Choisissez entre le thème clair et le thème sombre
it: Scegli tra modalità chiara e scura

source: Added dark mode and tooltip shortcuts
fr: Ajout du thème sombre et des indications de raccourcis
it: Aggiunta modalità scura e scorciatoie

source: Added dark mode
fr: Ajout du thème sombre
it: Aggiunta modalità scura

source: Added shortcuts to the button labels
fr: Ajout des raccourcis aux indicateurs des boutons
it: Aggiunte scorciatoie alle etichette dei pulsanti

source: Improved performance
fr: Amélioration des performances
it: Migliorate le performance

source: Improved the performance of the list view
fr: Amélioration des performances de la vue en liste
it: Miglioramento delle prestazioni della vista a elenco

source: Fixed Dutch grammar issues
fr: Correction de problème de grammaire en néerlandais
it: Risolta problemi di grammatica olandese

source: Added French metadata translations
fr: Ajout des traductions en français des métadonnées
it: Aggiunta la traduzione dei metadati in francese

source: Sharpened application icons
fr: Icônes de l'application affinées
it: Icone applicazione migliorate

source: Added metadata translations
fr: Ajout des traductions des métadonnées
it: Aggiunta della traduzione dei metadati

source: Added screenshot
fr: Ajout d'une capture d'écran
it: Aggiunti screenshot

source: Single-instancing now working
fr: L'instance unique fonctionne désormais
it: Single-instancing ora funziona

source: Improved project code quality
fr: Amélioration de la qualité du code du projet
it: Migliorata la qualità del codice

source: Remember size,position, and maximized
fr: L'application se souviens maintenant de la taille, de la position et de l'état maximisé de la fenêtre
it: Ricorda dimensione, posizione e se la finestra è massimizzata

source: Fixed bug opening welcome view from web store
fr: Correction d'un bug d'ouverture de l'écran de bienvenue depuis le magasin en ligne
it: Corretto un bug di visualizzazione nella schermata di benvenuto

source: Fixed the icon not found crash
fr: Correction du plantage à cause de l'icône non trouvée
it: Risolti i problemi di crash quando non trova le icone

source: Added screenshot for snaps
fr: Ajout d'une capture d'écran pour les snaps
it: Aggiunti screenshot per pacchetti snap

source: Refactored the detail view
fr: Refonte de la vue détaillée
it: Ricreata la visualizzazione nel dettaglio

source: Updated the screenshot for appcenter
fr: Mise à jour de la capture d'écran pour le Centre d'Applications
it: Aggiornati gli screenshot per AppCenter

source: Fixed a lot of warnings
fr: Correction de nombreux avertissements
it: Sistemati alcuni avvisi

source: Added OARS rating
fr: Ajout des classifications OARS
it: Aggiunta valutazione OARS

source: Icons, single-instance, and translations fix
fr: Icônes, instance unique, et correction des traductions
it: Icone, single-instance, e correzione traduzioni

source: Icons finally work!
fr: Les icônes fonctionnent enfin !
it: Le icone ora funzionano!

source: Application is now single-instance
fr: L'application est désormais une instance unique
it: Ora l'applicazione è single-instance

source: Translations are working again
fr: Les traductions fonctionnent de nouveau
it: Le traduzioni funzionano di nuovo

source: Fixed local snap installing, added channel support, added some shortcuts
fr: Correction de l'installation de snaps locaux, ajout du support des canaux, ajout de quelques raccourcis
it: Corretta l'installazione dello snap locali, aggiunto il supporto ai canali, aggiunte alcune scorciatoie

source: Fixed opening local snap files
fr: Correction de l'ouverture des fichiers snaps locaux
it: Risolto un problema nell'apertura dei file snap

source: Added ability to install from other channels
fr: Ajout de la possibilité d'installer à partir d'autres canaux
it: È ora possibile installare da altri canali

source: Channels are now shown on list and detail pages
fr: Les canaux sont désormais affichés en dans la liste et sur la vue détaillée
it: Ora i canali vengono mostrati nella lista e nel dettaglio

source: Added application shortcuts
fr: Ajout des raccourcis d'application
it: Aggiunte scorciatoie di applicazione

source: Moved to meson, apps can be opened from snaptastic again
fr: Passage à meson, les applications peuvent de nouveau être ouvertes depuis snaptastic
it: Migrato a meson, le app possono essere aperte di nuovo da snaptastic

source: Moved to Meson
fr: Passage à meson
it: Passato a Meson

source: Fixed the About link
fr: Correction du lien À propos
it: Corretto il link informazioni

source: Added French translation
fr: Ajout des traductions en français
it: Aggiunta traduzione Francese

source: Corrected some spelling
fr: Corrections d'orthographe
it: Correzione ai testi

source: Fixed opening apps
fr: Correction de l'ouverture des applications
it: Risolta l'apertura delle applicazioni

source: Juno Fixes and more translations
fr: Corrections pour Juno et plus de traductions
it: Risoluzione di bug per Juno e nuove traduzioni

source: Added Catalan and spanish translations
fr: Ajout des traductions en catalan et en espagnol
it: Aggiunte traduzioni Catalano e Spagnolo

source: Aligned DetailViewBanner for Juno
fr: Alignement de DetailviewBanner pour Juno
it: Allineato DetailViewBanner per Juno

source: Added Houston Ci and necessary changes
fr: Ajout de Houston CI et des modifications nécessaires
it: Aggiunto Houston Ci e modifiche necessarie

source: Japanese translation and Lithuanian translation fix
fr: Traduction en japonais et correction des traductions en lituanien
it: Traduzione in giapponese e traduzione in lituano

source: Added Japanese translation
fr: Ajout des traductions en japonais
it: Aggiunta traduzione giapponese

source: Added a fix for the Lithuanian translation
fr: Ajout d'une correction pour les traductions en lituanien
it: Aggiunta una correzione per la traduzione in lituano

source: Dutch translation and navigation bugfix
fr: Traduction en néerlandais et correction de bugs de navigation
it: Traduzione olandese e risoluzione dei bug di navigazione

source: Added dutch translation
fr: Ajout des traductions en néerlandais
it: Aggiunta traduzione Tedesco

source: Added a fix for the navigation bug
fr: Ajout d'une correction pour le bug de navigation
it: Risolto un bug della navigazione

source: Moved to glib
fr: Passage à glib
it: Passato a glib

source: Added 'about snaptastic' action
fr: Ajout de l'action « À propos de Snaptastic »
it: Aggiunta voce "Info su snaptastic"

source: Moved from snap cli to snapd-glib
fr: Passage de nsap cli à snap-glib
it: Passato da snap cli a snapd-glib

source: Added price for appcenter
fr: Ajout d'un prix pour le Centre d'Applications
it: Aggiunto il prezzo nell'AppCenter

source: Fixed some bugs, cleaned up some code
fr: Correction de certains bugs, nettoyage du code
it: Risolti alcuni bug, pulizia nel codice

source: Removed option to select multiple snaps
fr: Suppresion de l'option de sélection de plusieurs snaps
it: Rimossa l'opzione per la selezione multipla dei pacchetti snap

source: Fixed bug where sometimes wrong buttons would show up in header
fr: Correction d'un bug ou parfois les mauvais boutons s'affichaient dans la barre supérieure
it: Corretto un bug in cui a volte apparivano pulsanti sbagliati nell'intestazione

source: Cleaned up alot of code
fr: Nettoyage du code
it: Pulizia del codice

source: Updated language files
fr: Mise à jour des fichiers de langue
it: Aggiornati i file di traduzione

source: Updated app description
fr: Mise à jour de la description de l'application
it: Aggiornata la descrizione dell'applicazione

source: Added view for not yet installed packages
fr: Ajout d'une vue pour les paquets pas encore installés
it: Aggiunta vista per i pacchetti non ancora installati

source: Added extra screenshot for appcenter
fr: Ajout d'une capture d'écran supplémentaire pour le Centre d'Applications
it: Aggiunto screenshot extra per l'AppCenter

source: Switched background-color and text color for appcenter
fr: Modification de la couleur d'arrière plan et de la couleur du texte pour le Centre d'Applications
it: Colore di sfondo e colore del testo cambiati per l'AppCenter

source: List view overhaul
fr: Révision de la vue en liste
it: Revisione della visualizzazione a lista

source: Updated the detail view
fr: Mise à jour de la vue détaillée
it: Aggiornata la visualizzazione nel dettaglio

source: Removed the buttons from the list view
fr: Suppression des boutons de la vue en liste
it: Rimossi i pulsanti nella visualizzazione a lista

source: Removed delete and install button for the snap core
fr: Suppression du bouton supprimer et installer pour le noyau de snap
it: Rimossi i pulsanti elimina e installa per snap core

source: List view overhaul, and a link to snapcraft
fr: Révision de la vue en liste, et lien vers snapcraft
it: Révision de la vue en liste, et lien vers snapcraft

source: Added a link to snapcraft
fr: Ajout d'un lien vers snapcraft
it: Aggiunto link a snapcraft

source: Install straight from snapcraft.io!
fr: Installez directement depuis snapcraft.io !
it: Installare direttamente da snapcraft.io!

source: Application will now open on snap:// links
fr: L'application ouvrira désormais les liens snap://
it: Supporto ai link snap://

source: You can now launch your apps from the installed view
fr: Vous pouvez désormais lancer vos applications depuis la vue des applications installées
it: Ora potete lanciare le vostre applicazioni dalla vista installata

source: Fixed appdata file and changed a line for appcenter
fr: Correction du fichier appdata et modification d'une ligne pour le Centre d'Applications
it: Risolti problemi nel file appdata e modificato una riga per AppCenter

source: Fixed appdata file
fr: Correction du fichier appdata
it: Corretto il file appdata

source: The app is now Ubuntu styled
fr: L'application est désormais stylisée pour Ubuntu
it: L'applicazione è ora in stile Ubuntu

source: Made welcome text Title Case
fr: Texte de bienvenue avec majuscules
it: Il testo di benvenuto è ora Title Case

source: Set rounded bottom corners on window
fr: Coins arrondis sur la fenêtre
it: Impostati gli angoli inferiori arrotondati nella finestra

source: Added ubuntu styling through whole app
fr: Ajout du style d'Ubuntu à travers toute l'application
it: Aggiunto lo stile Ubuntu per l'intera app

source: Fixed some error typos
fr: Correction de quelques erreurs de typographie
it: Corretti alcuni errori di battitura

source: Fixed appcenter text color
fr: Correction de la couleur du texte dans le Centre d'Applications
it: Corretto il colore del testo nell'AppCenter

source: Added application to system category for appcenter
fr: Ajout de l'application à la catégorie Système du Centre d'Applications
it: Applicazione aggiunta alla categoria di sistema nell'AppCenter

source: A nicer not-found view!
fr: Une vue non trouvé plus sympa !
it: Aggiunta una visualizzazione migliore quando non viene trovato un pacchetto!

source: Vertical aligned delete dialog buttons
fr: Boutons de boîte de dialogue alignés verticalement
it: Pulsanti di dialogo di cancellazione allineati verticalmente

source: Added a nicer view for no results
fr: Ajout d'une vue plus sympa en cas de non résultat
it: Aggiunta una visualizzazione migliore quando non ci sono risultati

source: Modified alert dialog and added snapd as dependency
fr: Modification des boîtes de dialogue et ajout de snap en dépendance
it: Modificata la finestra di dialogo e aggiunto snapd come dipendenza

source: Changed alert cancel button to close button
fr: Modification du bouton annuler de la boîte de dialogue en bouton fermer
it: Pulsante di cancellazione ora chiude la finestra di dialogo

source: alert is now positioned to center of app
fr: La boîte de dialogue est désormais positionnée au centre de l'application
it: Gli avvisi sono ora posizionati al centro dell'app

source: Application now depends on snapd
fr: L'application dépend maintenant de snapd
it: Ora l'applicazione dipende da snapd

source: Updated icons
fr: Mise à jour des icônes
it: Aggiornate le icone

source: Fixed the appdata xml
fr: Correction du xml de appdata
it: Corretto appdata xml

source: Fixed xml
fr: Correction du xml
it: Corretto xml

source: Removed alert and fixed polkit calls
fr: Supression de la boîte de dialogue et correction des appels à polkit
it: Rimosso avviso e corrette le chiamate polkit

source: Removed alert
fr: Supression de la boîte de dialogue
it: Rimosso avviso

source: Fixed polkit calls
fr: Correction des appels à polkit
it: Corrette le chiamate polkit

source: Updated readme and debian/control file
fr: Mise à jour des fichiers readme et debian/control
it: Aggiornato file readme e debian/control

source: Updated readme, removed lines which dont apply
fr: Mise à jour du fichier readme, supression des lignes qui ne s'appliquent plus
it: Aggiornato readme, rimosse alcune righe

source: Updated debian/control file
fr: Mise à jour du fichier debian/control
it: Aggiornato il file debian/control

source: First release
fr: Première version
it: Prima release

source: GUI;Snaps;
fr: Interface graphique;Snaps;

source: About Snaptastic
fr: À propos de Snaptastic
it: Info su Snaptastic
