Repository: bartzaalberg/snaptastic
Catalog: po/*.po
Languages: ca, es, it, ja, lt, nl, ru, tr

source: Refresh
ca: Actualitza
es: Actualizar
it: Ricarica
ja: 更新
lt: Įkelti iš naujo
nl: Verversen
ru: Обновить
tr: Yenile

source: Update this to latest version
ca: Actualitza’l a la versió més recent
es: Actualizarlo a la versión más reciente
it: Aggiorna all'ultima versione
ja: 最新のバージョンにアップデートします
lt: Atnaujinti į naujausią versiją
nl: Update deze applicatie naar de laatste versie
ru: Обновление до последней версии
tr: Son sürüme yükselt

source: Uninstall
ca: Desinsta·la
es: Desinstalar
it: Disinstalla
ja: アンインストール
lt: Šalinti
nl: Deinstalleer
ru: Удалить
tr: Kaldır

source: Uninstall this application
ca: Desinstal·la aquesta aplicació
es: Desinstalar esta aplicación
it: Disinstalla applicazione
ja: このアプリケーションをアンインストールします
lt: Pašalinti šią programą
nl: Deinstalleer deze applicatie
ru: Удаление приложения
tr: Bu uygulamayı kaldır

source: Install
ca: Instal·la
es: Instalar
it: Installa
ja: インストール
lt: Įdiegti
nl: Installeren
ru: Установить
tr: Kur

source: Install this application
ca: Instal·la aquesta aplicació
es: Instalar esta aplicación
it: Installa applicazione
ja: このアプリケーションをインストールします
lt: Įdiegti šią programą
nl: Installeer deze applicatie
ru: Установка этого приложения
tr: Bu uygulamayı kur

source: Open
ca: Obre
es: Abrir
it: Apri
ja: 開く
lt: Atverti
nl: Openen
ru: Открыть
tr: Aç

source: Run the application
ca: Executa l’aplicació
es: Ejecutar la aplicación
it: Avvia applicazione
ja: アプリケーションを実行します
lt: Paleisti programą
nl: Open de applicatie
ru: Запуск приложения
tr: Uygulamayı çalıştır

source: Delete this application?
ca: Voleu desinstal·lar aquesta aplicació?
es: ¿Quiere desinstalar esta aplicación?
it: Eliminare l'applicazione?
ja: このアプリケーションを削除しますか？
lt: Ištrinti šią programą?
nl: Verwijder deze applicatie?
ru: Удалить это приложение?
tr: Bu uygulamayı sil?

source: Are you sure you want to delete this application?
ca: Esteu segur que voleu desinstal·lar aquesta aplicació?
es: ¿Confirma que quiere desinstalar esta aplicación?
it: Sicuro di voler eliminare l'applicazione?
ja: このアプリケーションを削除してもよろしいですか？
lt: Ar tikrai norite ištrinti šią programą?
nl: Weet u zeker dat u deze applicatie wilt verwijderen?
ru: Вы уверены, что хотите удалить это приложение?
tr: Bu uygulamayı silmek istediğinize emin misiniz?

source: No snaps were found
ca: No s’ha trobat cap snap
es: No se encontró ningún snap
it: Nessun pacchetto snap trovato
ja: Snap ファイルが見つかりません
lt: Nebuvo rasta jokių snap paketų
nl: Er zijn geen snaps gevonden
ru: Snap-пакеты не найдены
tr: Snaplar bulunamadı

source: Please install some
ca: Instal·leu-ne uns quants
es: Instale algunos
it: Installane alcuni
ja: 何かインストールしてください
lt: Prašome įdiegti bent vieną
nl: Installeer er eens wat
ru: Пожалуйста установите некоторые
tr: Lütfen biraz kur

source: Install Some Snaps
ca: Instal·leu alguns snaps
es: Instálese algunos snaps
it: Installa qualche pacchetto snap
ja: Snap ファイルをインストールしましょう
lt: Įdiegti snap paketus
nl: Installeer Snaps
ru: Устанавка snap-пакетов
tr: Biraz snap kur

source: Click open to select a downloaded snap file
ca: Feu clic a «Obre» per a seleccionar un fitxer snap que hàgiu baixat
es: Pulse en «Abrir» para seleccionar un archivo snap descargado
it: Clicca Apri per selezionare un pacchetto snap scaricato
ja: [開く] をクリックしてダウンロードした Snap ファイルを選択してください
lt: Norėdami pasirinkti atsisiųsta snap failą, spustelėkite "Atverti"
nl: Klik open om een gedownloade snap te selecteren
ru: Нажмите "Открыть", чтобы выбрать загруженный snap-файл
tr: İndirilmiş snap dosyasını açmak için tıklayın

source: Browse to open a single snap file
ca: Exploreu per a obrir un fitxer snap
es: Explore para abrir un archivo snap
it: Sfoglia per caricare un pacchetto snap
ja: ブラウズして Snap ファイルを一つ開きます
lt: Naršykite, norėdami atverti atskirą snap failą
nl: Bladeren om een snap te selecteren
ru: Открытие одиночного snap-файла
tr: Snap dosyası için göz atın

source: Please Wait…
ca: Espereu…
es: Espere…
it: Attendi…
ja: お待ちください…
nl: Even geduld…
ru: Пожалуйста, подождите…
tr: Lütfen Bekleyin…

source: Operation is in progress…
ca: L’operació està progressant…
es: La operación está en curso…
it: Operazione in corso…
ja: 処理が進行しています…
nl: Handeling wordt momenteel verricht…
ru: Операция в процессе…
tr: İşlem sürüyor…

source: Home
it: Inizio
ru: Главная
tr: Anasayfa

source: Go to home
it: Torna all'inizio
nl: Ga terug naar home
ru: Переход на главную страницу
tr: Anasayfaya git

source: Updates
it: Aggiornamenti
ru: Обновления
tr: Güncellemeler

source: Go to installed applications
it: Vai alle applicazioni installate
nl: Ga naar geinstalleerde applicaties
ru: Переход к установленным приложениям
tr: Kurulu uygulamalara git

source: Back
ca: Enrere
es: Atrás
it: Indietro
ja: 戻る
lt: Atgal
nl: Terug
ru: Назад
tr: Geri

source: Light mode
it: Modalità chiara
nl: Lichte modus
ru: Светлая тема
tr: Aydınlık mod

source: Dark mode
it: Modalità scura
nl: Donkere modus
ru: Темная тема
tr: Karanlık mod

source: Please Wait
lt: Prašome palaukti...

source: Operation is in progress
lt: Operacija eigoje...

source: Package Information
lt: Paketo informacija

source: Developer
lt: Kūrėjas
